# IFCProperty Set Mapping Info Properties

Source: https://www.revitapidocs.com/2026/c11c132c-bf48-50ee-e670-d26614590a85.htm

---

| IFCProperty Set Mapping Info Properties |
| --- |

The IFCPropertySetMappingInfo type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

Top See Also

#### Reference

IFCPropertySetMappingInfo Class Autodesk.Revit.DB Namespace